import mongoose from "mongoose";
import config from "./config";
import User from "./models/User";
import * as crypto from "crypto";
import Post from "./models/Post";
import Comment from "./models/Comment";

const run = async () => {
    await mongoose.connect(config.db);
    const db = mongoose.connection;
    const currentDate = new Date();

    try {
        await db.dropCollection('users');
        await db.dropCollection('posts');
        await db.dropCollection('comments')
    } catch (e) {
        console.log('Collection not deleted')
    }
    const [user1, user2, user3] = await User.create({
        username: 'Anna',
        password:'123',
        token:crypto.randomUUID()
    }, {
        username: 'Bob',
        password:'456',
        token:crypto.randomUUID()
    },{
        username: 'Alan',
        password:'789',
        token:crypto.randomUUID()
    });
    const [post1, post2, post3, post4] =await Post.create({
       author: user1._id,
       title: '«Звездная ночь» (нидерл. De sterrennacht) ',
       description: 'Одна из наиболее известных картин нидерландского художника-постимпрессиониста Винсента Ван Гога. Представляет вид из восточного окна спальни Ван Гога в Сен-Реми-де-Прованс на предрассветное небо и вымышленную деревню. Картина написана в июне 1889 года; с 1941 года хранится в Музее современного искусства в Нью-Йорке. По мнению известного астрофизика Нила Тайсона - это первая картина, на которой небо является главным предметом изображения.',
       image: 'first.jpg',
       date: currentDate
    }, {
        author: user1._id,
        title: '«Звездная ночь над Роной»',
        description: 'Одна из картин художника-постимпрессиониста Винсента Ван Гога, изображающих Арль; на сей раз — ночью. Хранится в музее д’Орсе, в Париже. Картина изображает место на реке в двух минутах ходьбы от Жёлтого дома на площади Ламартен, который Ван Гог арендовал некоторое время. Ночное небо и эффекты звёздного света и света фонарей роднят эту картину с иными шедеврами художника — «Ночной террасой кафе» (написанной за месяц до работы над «Звёздной ночью над Роной») и более поздней «Звёздной ночью».',
        image: 'second.jpg',
        date: currentDate
    }, {
        author: user2._id,
        title: '«Постоянство памяти» (исп. La persistencia de la memoria, 1931) ',
        description: 'одна из самых известных картин художника Сальвадора Дали. Находится в Музее современного искусства в Нью-Йорке с 1934 года.Известна также как «Мягкие часы», «Утекающее время», «Твердость памяти» или «Стойкость памяти» или «Течение времени» или «Время». Эта небольшая картина (24х33 см) — вероятно, самая известная работа Дали. Размягченность висящих и стекающих часов — образ, выражающий уход от линейного понимания времени. Здесь присутствует и сам Дали в виде спящей головы, уже появлявшейся в «Траурной игре» и других картинах. Сообразно своему методу, художник объяснял происхождение сюжета размышлением о природе сыра камамбер; пейзаж с Порт Лигат был уже готов, так что написать картину было делом двух часов. Вернувшись из кино, куда она ходила в тот вечер, Гала совершенно правильно предсказала, что никто, раз увидев «Постоянство памяти», уже его не забудет. Написанию картины, по-видимому, могли способствовать ассоциации, возникавшие у Дали при виде плавленого сыра (на это указывает его высказывание)',
        image: 'third.webp',
        date: currentDate
    }, {
        author: user2._id,
        title: '«Демон сидящий» Михаил Врубель.',
        description: 'Картина Михаила Врубеля удивляет образом демона. Его печальный вид совсем не похож на общечеловеческие представления о том, как должен выглядеть злой дух.Это образ силы человеческого духа, внутренней борьбы, сомнений. Трагически сцепив руки, Демон сидит в окружении цветов, устремив свой взгляд вдаль. Композиция подчеркивает стесненность его фигуры, будто бы зажатой между верхней и нижней перекладинами рамы.',
        image: 'fourth.jpg',
        date: currentDate
    });
    await Comment.create({
        author: user1._id,
        post: post3._id,
        text: 'Эта картина удивительно креативна и экспрессивна. Я восхищаюсь смелостью автора и его способностью выразить сложные эмоции через художественное произведение.'
    }, {
        author: user1._id,
        post: post4._id,
        text:'Картина вызывает у меня глубокие размышления. Она словно открывает дверь в другой мир, полный загадок и тайн, которые я хочу исследовать.'
    }, {
        author: user2._id,
        post: post1._id,
        text: 'Невероятная техника и детализация! Однако, она создает некоторую дистанцию между зрителем и произведением искусства, и мне кажется, что оно недоступно для понимания'
    }, {
        author: user2._id,
        post: post2._id,
        text:'Меня поразила глубина эмоций, выраженная на этой картине. В каждом мазке кажется скрыта целая история'
    },{
        author: user3._id,
        post: post1._id,
        text: 'Я не могу понять, что автор хотел сказать этой картиной. Она кажется бессмысленной и абстрактной'
    }, {
        author: user3._id,
        post: post2._id,
        text:'Великолепное сочетание цветов и тени создают невероятную атмосферу. Я чувствую себя, как будто погружен в этот мир.'
    },{
        author: user3._id,
        post: post3._id,
        text: 'Картина оставила меня равнодушным. Ее стиль и композиция не вызывают во мне никаких чувств или эмоций.'
    },{
        author: user3._id,
        post: post4._id,
        text: 'Сам художник говорил о самой известной своей картине: «Демон — дух не столько злобный, сколько страдающий и скорбный, при всем этом дух властный, величавый».',
    },)

    await db.close();
};

run().catch(console.error);